# Packages

# my shell of choice
brew 'zsh'
brew 'git'
# ruby version manager
brew 'rbenv'
brew 'ruby-build'
brew 'vim', args: ['override-system-vi', 'with-lua']
brew 'node'
brew 'python'
brew 'go'
brew 'imagemagick'
# imagemagick needs ghostscript to convert pdfs
brew 'ghostscript'
# ffmpeg is a CLI tool for video editing
brew 'ffmpeg'
# to jump between folders without going through the filesystem hierarchy
brew 'autojump'
brew 'lua'
# the Clojure dependency manager and build automation tool
brew 'leiningen'
# some lldb functions to help debugging from the Xcode console
brew 'chisel'
# decentralized dependencies manager, made for iOS development
brew 'carthage'
# hub is a tool to work with GitHub wfrom the command line
brew 'hub'
# EditorConfig is a tool to keep coding styles consistent across IDEs
brew 'editorconfig'
# send user notifcations from the terminal
brew 'terminal-notifier'
# linter for Swift
brew 'swiftlint'
# Git Large File System support
brew 'git-lfs'
# better cat
brew 'bat'

tap 'thoughtbot/formulae'
# tool to create Xcode projects from command line
brew 'liftoff'

# tool to quickly create gitignores
tap 'karan/karan'
brew 'gitignore'

# Apps

# brew-cask and the caskroom formulae allows us to install Mac apps through homebrew
tap 'caskroom/cask'

# a Terminal.app replacement
cask 'iterm2'
cask 'google-chrome'
# a Spotlight replacement, plus many automation features
cask 'alfred'
# Window manager configurable via a script
cask 'hammerspoon'
# change the screen temperature according to the time of the day
cask 'flux'
# tap button without using the mouse, just by typing their names
cask 'shortcat'
cask 'dropbox'
cask 'spotify'
cask 'slack'
cask 'skype'
# a YouTube client that can stay always in on top
cask 'tubbler'
cask '1password'
# an hackable text editor by GitHub
cask 'atom'
# IDE to replace Xcode, with powerful refactoring tools
cask 'appcode'
# an app that inspects Xcode's projects and highlights issues and possible optimizations
cask 'fauxpas'
# offline documentation browser
cask 'dash'
# tool to remap keys, I use it to map Caps Lock to Delete, in Colemak style
cask 'seil'
# Nintendo 64 emulator
cask 'sixtyforce'
cask 'java'
cask 'vlc'
# background app that tracks how you spend your time on the computer
cask 'rescuetime'

# Quick Look Plugins

cask 'qlcolorcode'
# view plain text files without a file extension
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
# view .ipa and .mobileprovision files
cask 'provisionql'

mas 'Spark', id: 1176895641
